Revit 2027 API
Wall.Create(Document, IList<Curve>, Boolean) Method
 Creates a non rectangular profile wall within the project using the default wall type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Wall Create(
	Document document,
	IList<Curve> profile,
	bool structural
)
Public Shared Function Create (
	document As Document,
	profile As IList(Of Curve),
	structural As Boolean
) As Wall
public:
static Wall^ Create(
	Document^ document,
	IList<Curve^>^ profile,
	bool structural
)
static member Create :
        document : Document *
        profile : IList<Curve> *
        structural : bool -> Wall
Parameters
document Document
 The document in which the new wall is created.
profile IList<Curve>
 An array of planar curves that represent the vertical profile of the wall.
structural Boolean
 If set, specifies that the wall is structural in nature.
Return Value
Wall
 If successful a new wall object within the project.
Exceptions
Exception | Condition
ArgumentException |  The input profile contains at least one helical curve and is not supported for this operation.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to create the wall.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
Wall Class
Create Overload
Autodesk.Revit.DB Namespace